/*Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран. Данные вводятся с консоли пользователем*/

// int[] arr = new int[8];
// int n = arr.Length;
// Random rnd = new Random();
// for (int i = 0; i < n; i++)
// {
//     arr[i] = rnd.Next(0, 2);
// }
// Console.WriteLine(string.Join(", ", arr));

//foreach (int el in arr)
// {
//   Console.Write(el);
// }

Console.WriteLine(string.Join(", ", arr));
